src/main/test/supply-chain/3-Calculation/0-Apply Tax/10-New added test cases/1-TC.01.04.46_RIXItem_TaxCode4_db_change/0-TC01.04.46_RIXItem_TaxCode4_db_change_1/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax><!--Optional:-->
         <arg0><DocumentId>
               <SystemSourceId>ICI001</SystemSourceId>
               <TransactionId/>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>TEST2_RIX4-N</CustomField1>
               <CustomField2/>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10>TEST</CustomField10>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
            <CalculationDecimalPlaces/>
            <PreviousInvoiceTaxCountry/>
            <TaxDecisionSet>
               <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation/>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </SellerTaxIndicator>
               <SellerTaxCountry/>
               <SellerTaxState/>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation/>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry/>
               <BuyerTaxState/>
               <CombinedTaxIndicator/>
               <CommercialIndicator/>
               <SellerTaxRegCountry/>
               <SellerTaxRegState/>
               <BuyerTaxRegCountry/>
               <BuyerTaxRegState/>
               <SellerTaxTotal>
                  <NetAmount/>
                  <TaxAmount/>
                  <GrossAmount/>
                  <TaxAmountInLocalCurrency/>
                  <TaxInvoiceSubTotal>
                     <TaxType/>
                     <TaxCode/>
                     <TaxRate/>
                     <NetAmount/>
                     <TaxAmount/>
                     <GrossAmount/>
                     <TaxAmountInLocalCurrency/>
                  </TaxInvoiceSubTotal>
               </SellerTaxTotal>
               <BuyerTaxTotal>
                  <NetAmount/>
                  <TaxAmount/>
                  <GrossAmount/>
                  <TaxAmountInLocalCurrency/>
                  <TaxInvoiceSubTotal>
                     <TaxType/>
                     <TaxCode/>
                     <TaxRate/>
                     <NetAmount/>
                     <TaxAmount/>
                     <GrossAmount/>
                     <TaxAmountInLocalCurrency/>
                  </TaxInvoiceSubTotal>
               </BuyerTaxTotal>
               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyExchangeRate/>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyExchangeRate/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel/>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>30151672</ItemNo>
                  <ItemType>ART</ItemType>
                  <UNSPSC>56000000</UNSPSC>
                  <Classification/>
                  <SubClassification/>
                  <NetAmount>8.00</NetAmount>
                  <SellerCountry/>
                  <SellerState/>
                  <BuyerCountry/>
                  <BuyerState/>
                  <VariableTaxSteeringInput>
                     <ConsignorCountry/>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode/>
                     <ConsignorBusinessUnitType/>
                     <ConsigneeCountry/>
                     <ConsigneeState/>
                     <ConsigneeBusinessUnitCode/>
                     <ConsigneeBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                  </VariableTaxSteeringInput>
               </TaxInvoiceLine>
               
            </TaxDecisionSet>
            <TaxDate>
               <TaxAlgorithmDate>2017-08-11</TaxAlgorithmDate>
               <TaxCalculationDate>2017-08-11</TaxCalculationDate>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>N</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry/>
               <ConsignorState/>
               <ConsignorBusinessUnitCode>390</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType>DT</ConsignorBusinessUnitType>
               <ConsigneeCountry/>
               <ConsigneeState/>
               <ConsigneeBusinessUnitCode>144</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
               <ShipmentStartCountry/>
               <ShipmentEndCountry/>
               <ShipmentStartState/>
               <ShipmentEndState/>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose>Y</ResalePurpose>
               <IsOutBonded>N</IsOutBonded>
               <IsInBonded>N</IsInBonded>
               <TaxPreAlgorithmOutput>
                  <IsExport>N</IsExport>
                  <IsImport>N</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>N</IsImported>
               </TaxPreAlgorithmOutput>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>1840</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode/>
                     <StateCode/>
                  </PartyAddress>
               </Party>
               
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>5100</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode/>
                     <StateCode/>
                  </PartyAddress>
               </Party>
              
            </SellerParty>
            <TermOfDelivery/></arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>